fonecmid-diplom.Расширение/src/Documents/ВКМ_ПараметрыРасчетаЗПСотрудников/ВКМ_ПараметрыРасчетаЗПСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ПараметрыРасчетаЗПСотрудников</name>
  <registerRecords>InformationRegister.ВКМ_ПараметрыРасчетаЗПСотрудников</registerRecords>
  <attributes>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Процент</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
</mdclass:Document>

fonecmid-diplom.Расширение/src/InformationRegisters/ВКМ_ПараметрыРасчетаЗПСотрудников/ВКМ_ПараметрыРасчетаЗПСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_ПараметрыРасчетаЗПСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>ВКМ_Оклад</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Процент</name>
    <type>
      <types>DefinedType.ВКМ_Денежный</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРаботы</types>
    </type>
  </attributes>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

fonecmid-diplom.Расширение/src/Documents/ВКМ_ПараметрыРасчетаЗПСотрудников/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ВКМ_ПараметрыРасчетаЗПСотрудников
	Движения.ВКМ_ПараметрыРасчетаЗПСотрудников.Записывать = Истина;
	Движение = Движения.ВКМ_ПараметрыРасчетаЗПСотрудников.Добавить();
	Движение.Период = Дата;
	Движение.ВКМ_Сотрудник = ВКМ_Сотрудник;
	Движение.ВКМ_Оклад = ВКМ_Оклад;
	Движение.ВКМ_Процент = ВКМ_Процент;
	Движение.ВКМ_ГрафикРаботы = ВКМ_ГрафикРаботы;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
